#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_secretsmanager_secret.github_token: Reading...
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_lb_target_group.gtw_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/e92af65a6dac2f8c]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/1d41569bc3f6f084]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb.gtw_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1f39d5fb5b904535]
aws_lb.bff_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/ccd961898ba643ba]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_lb_listener.gtw_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/ccd961898ba643ba/19d9ea7e8bb3d787]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/ccd961898ba643ba/7a099a3b3cf0425f]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_task_definition.gtw_service_app: Refreshing state... [id=gtw-service-app-task]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]
aws_ecs_service.gtw_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.gtw_service will be updated in-place
  ~ resource "aws_ecs_service" "gtw_service" {
        id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service"
        name                               = "gtw-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.gtw_service_app must be replaced
-/+ resource "aws_ecs_task_definition" "gtw_service_app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "ASICS_AUTH_INTROSPECT_ENDPOINT"
                            value = "https://id-sandbox.asics.com/api/v2/introspect"
                        },
                      ~ {
                            name  = "BFF_URL"
                          ~ value = "internal-bff-alb-1965968170.eu-west-1.elb.amazonaws.com" -> "http://localhost:8081"
                        },
                        {
                            name  = "CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                            value = "50"
                        },
                        # (11 unchanged elements hidden)
                    ]
                  - essential        = true
                  - mountPoints      = []
                    name             = "gtw-service"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "gtw-service-app-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-06e777883e1f5464b"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0f505df8b5227d2be"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*